[
  {
    "name": "The 'Low Maintenance' Bamboo Forest",
    "description": "Client insisted on bamboo for 'easy care'. Now their neighbor's yard is also a bamboo forest. Surprise!",
    "design_notes": "We recommended containment barriers. They declined. The lawsuit should be fun."
  },
  {
    "name": "The 'Why Is My Water Bill So High?' Project",
    "description": "Lush English garden installed in Arizona desert. Currently using more water than the entire neighborhood combined.",
    "design_notes": "Client wanted 'that green look'. We suggested astroturf. They called us 'unimaginative'."
  },
  {
    "name": "The 'I Want Color Year-Round' Fantasy",
    "description": "Installed 17 varieties that bloom in different seasons. Looks spectacular for 3 days each year and terrible the other 362.",
    "design_notes": "Nature doesn't work like a Pinterest board, Karen."
  },
  {
    "name": "The 'No Bees Please' Paradox",
    "description": "Client wanted flowers but 'no bugs'. Created a beautiful silk flower arrangement. Real ones would attract bees. Duh.",
    "design_notes": "Explained pollination. Client suggested we 'find flowers that don't do that'."
  },
  {
    "name": "The 'Toddler Run' Redesign",
    "description": "Replaced delicate perennials with indestructible shrubs after client's child used the garden as a stomping ground.",
    "design_notes": "Should have just installed a bounce house and called it a day."
  },
  {
    "name": "The 'Too Much Money' Water Feature",
    "description": "Seven-tiered fountain with LED lighting and imported Italian marble. Neighbors hate the constant splashing sounds.",
    "design_notes": "Client's request: 'Make it look like the Bellagio but for squirrels'."
  },
  {
    "name": "The 'Native Plants' Charade",
    "description": "Client insisted on 100% native species... then demanded we include hydrangeas, roses, and other decidedly non-native plants.",
    "design_notes": "We drew the line at palm trees. This is Minnesota."
  },
  {
    "name": "The 'Privacy Hedge' That Won't Grow",
    "description": "Planted tiny arborvitae that will provide privacy in approximately 27 years. Neighbors can currently watch you shower.",
    "design_notes": "Client refused mature plants because 'they cost too much'. Enjoy your fishbowl existence!"
  },
  {
    "name": "The 'We Have Perfect Soil' Debacle",
    "description": "Client swore their soil was amazing. Our testing revealed concrete runoff, motor oil, and the shattered dreams of previous gardeners.",
    "design_notes": "Installed raised beds filled with actual soil. Client complained about the cost."
  },
  {
    "name": "The 'But It's Organic!' Nightmare",
    "description": "Client refused all pest control methods except positive vibes and essential oils. Plants currently being devoured by aphids.",
    "design_notes": "We offered to bless the garden with crystals. They said yes unironically."
  },
  {
    "name": "The 'I'll Do the Maintenance' Lie",
    "description": "Designed intricate formal garden with client's assurance they'd handle upkeep. Received panicked call about 'plant things needing stuff' two weeks later.",
    "design_notes": "Now on speed dial for 'what's this weed?' texts at 7am."
  },
  {
    "name": "The 'Dog-Safe' Garden",
    "description": "Every plant non-toxic to canines. Unfortunately, Fido prefers to snack on the teak benches and irrigation system.",
    "design_notes": "Should have made the whole thing out of Nylabones."
  },
  {
    "name": "The 'Drought-Tolerant' Swamp",
    "description": "Installed xeriscaping, then client overwatered obsessively. Now hosting the only cactus in history to die of root rot.",
    "design_notes": "Installed 'this plant needs neglect' signs. Client waters them daily."
  },
  {
    "name": "The 'Butterfly Garden' (Spiders Included)",
    "description": "Lush plants to attract pollinators. Also attracted every spider within three miles. Client shocked that nature includes bugs.",
    "design_notes": "Client asked if we could make butterflies without caterpillars. We laughed. They were serious."
  },
  {
    "name": "The 'Fast-Growing' Vine Disaster",
    "description": "Installed beautiful ivy that has now consumed the shed, two trees, and possibly a small pet. Client can't find their house.",
    "design_notes": "Should have specified that 'fast-growing' isn't just marketing speak."
  },
  {
    "name": "The 'Shade Garden' in Full Sun",
    "description": "Client insisted on hostas and ferns... in their south-facing yard. They're now the crispiest plants in the neighborhood.",
    "design_notes": "Explained sun requirements. Client said 'but they're so pretty'. RIP."
  },
  {
    "name": "The 'Low-Light Indoor Jungle' Delusion",
    "description": "Apartment with two north-facing windows now filled with dying tropical plants. Client waters them with tears.",
    "design_notes": "Recommended grow lights. Client wanted 'all natural'. Nature said no."
  },
  {
    "name": "The 'Child-Friendly' Yard",
    "description": "Soft artificial turf, rounded edges, safe plants. Kids exclusively play inside with iPads.",
    "design_notes": "Should have just projected a nature screensaver on the wall."
  },
  {
    "name": "The 'I Want a Lawn But Also Hate Mowing' Paradox",
    "description": "Installed perfect Kentucky bluegrass. Client now complains about having to mow weekly. Astroturf looking better every day.",
    "design_notes": "Grass grows. This is not our fault."
  },
  {
    "name": "The 'Deer-Proof' Buffet",
    "description": "Used every deer-resistant plant in the catalog. Deer, being illiterate, ate them all anyway.",
    "design_notes": "Client asked for 'deer-proof' plants. We explained these don't exist. They insisted."
  },
  {
    "name": "The 'Winter Interest' Sadness",
    "description": "Beautiful seed heads and ornamental grasses left standing for winter beauty. Client says it 'just looks dead'.",
    "design_notes": "Explained seasons. Client suggested we find plants that 'stay pretty' year-round."
  },
  {
    "name": "The 'Too Many Colors' Rainbow Explosion",
    "description": "Client refused to choose a color scheme. The result looks like a clown's idea of a garden. Neighbors wear sunglasses.",
    "design_notes": "We suggested cohesion. Client said 'I like all the colors'. Mission accomplished."
  },
  {
    "name": "The 'Small Tree' That Wasn't",
    "description": "Planted 'dwarf' variety that's now 25 feet tall and growing through power lines. Nursery claims 'it must be happy here'.",
    "design_notes": "Client refuses to prune because 'it's natural'. Power company disagrees."
  },
  {
    "name": "The 'Instant Mature Garden' Fantasy",
    "description": "Client wanted 'full and lush' immediately without paying for mature plants. Now staring at sad little sprouts and disappointment.",
    "design_notes": "Explained that gardens grow. Client asked if we could 'speed it up'."
  },
  {
    "name": "The 'No Chemicals' Battlefield",
    "description": "Organic garden currently losing war against every pest in the county. Japanese beetles throwing parties in the roses.",
    "design_notes": "Client refuses to intervene because 'nature will balance itself'. Nature is currently drunk and destructive."
  },
  {
    "name": "The 'I Changed My Mind' Redesign",
    "description": "Third complete overhaul this year. Current theme: 'English cottage meets Japanese zen with desert succulents'. It's a crime against horticulture.",
    "design_notes": "Started charging 'indecision fees'. Client paid without blinking."
  }
]
